roniererezende/STM32_Projects/STM32_Test_Board/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BUTTON_ONE_Pin GPIO_PIN_0
#define BUTTON_ONE_GPIO_Port GPIOB
#define BUTTON_TWO_Pin GPIO_PIN_1
#define BUTTON_TWO_GPIO_Port GPIOB
#define BUTTON_THREE_Pin GPIO_PIN_2
#define BUTTON_THREE_GPIO_Port GPIOB
#define BUTTON_FOUR_Pin GPIO_PIN_10
#define BUTTON_FOUR_GPIO_Port GPIOB
#define BUTTON_FIVE_Pin GPIO_PIN_11
#define BUTTON_FIVE_GPIO_Port GPIOB
#define LED_LIGHT_Pin GPIO_PIN_12
#define LED_LIGHT_GPIO_Port GPIOB
#define LED_YELLOW_Pin GPIO_PIN_13
#define LED_YELLOW_GPIO_Port GPIOB
#define LED_BLUE_A_Pin GPIO_PIN_14
#define LED_BLUE_A_GPIO_Port GPIOB
#define LED_BLUE_B_Pin GPIO_PIN_15
#define LED_BLUE_B_GPIO_Port GPIOB
#define LED_RED_A_Pin GPIO_PIN_8
#define LED_RED_A_GPIO_Port GPIOA
#define LED_RED_B_Pin GPIO_PIN_9
#define LED_RED_B_GPIO_Port GPIOA
#define LED_GREEN_Pin GPIO_PIN_6
#define LED_GREEN_GPIO_Port GPIOC
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
